```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

2020/10/08 12:00:08 [DEBUG] command: asking for input: "Do you want to perform these actions?"
Terraform will perform the following actions:

  # module.vpc.ibm_is_vpc.testacc_vpc will be created
  + resource "ibm_is_vpc" "testacc_vpc" {
      + address_prefix_management = "auto"
      + classic_access            = false
      + crn                       = (known after apply)
      + cse_source_addresses      = (known after apply)
      + default_network_acl       = (known after apply)
      + default_security_group    = (known after apply)
      + id                        = (known after apply)
      + name                      = "vpcnewmodule"
      + resource_controller_url   = (known after apply)
      + resource_crn              = (known after apply)
      + resource_group            = "e0f810a2df8b46c0b05555b4ab8823b5"
      + resource_group_name       = (known after apply)
      + resource_name             = (known after apply)
      + resource_status           = (known after apply)
      + security_group            = (known after apply)
      + status                    = (known after apply)
      + subnets                   = (known after apply)
      + tags                      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes
2020/10/08 12:00:10 [INFO] backend/local: apply calling Apply

2020/10/08 12:00:10 [INFO] terraform: building graph: GraphTypeApply
2020/10/08 12:00:10 [DEBUG] Resource state not found for node "module.vpc.ibm_is_vpc.testacc_vpc", instance module.vpc.ibm_is_vpc.testacc_vpc
2020/10/08 12:00:10 [DEBUG] ProviderTransformer: "module.vpc.ibm_is_vpc.testacc_vpc (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/10/08 12:00:10 [DEBUG] ProviderTransformer: "data.ibm_resource_group.resource_group (prepare state)" (*terraform.NodeApplyableResource) needs provider.ibm
2020/10/08 12:00:10 [DEBUG] ProviderTransformer: "module.vpc.ibm_is_vpc.testacc_vpc" (*terraform.NodeApplyableResourceInstance) needs provider.ibm
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "var.address_prefix_management" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.output.vpc_id" references: [module.vpc.ibm_is_vpc.testacc_vpc module.vpc.ibm_is_vpc.testacc_vpc module.vpc.ibm_is_vpc.testacc_vpc (prepare state)]
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "data.ibm_resource_group.resource_group (prepare state)" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.ibm_is_vpc.testacc_vpc" references: [module.vpc.var.tags module.vpc.var.resource_group_id module.vpc.var.classic_access module.vpc.var.name module.vpc.var.address_prefix_management]
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "var.classic_access" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.var.address_prefix_management" references: [var.address_prefix_management]
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.var.tags" references: [var.tags var.tags]
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.var.name" references: [var.name]
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "var.name" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "var.resource_group" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "provider.ibm" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "var.tags" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.var.resource_group_id" references: [data.ibm_resource_group.resource_group (prepare state)]
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.ibm_is_vpc.testacc_vpc (prepare state)" references: []
2020/10/08 12:00:10 [DEBUG] ReferenceTransformer: "module.vpc.var.classic_access" references: [var.classic_access]
0/08 12:00:10 [DEBUG] Starting graph walk: walkApply
2020-10-08T12:00:10.511+0530 [INFO]  plugin: configuring client automatic mTLS
2020-10-08T12:00:10.546+0530 [DEBUG] plugin: starting plugin: path=/Users/vaishnavi/go/bin/terraform-provider-ibm args=[/Users/vaishnavi/go/bin/terraform-provider-ibm]
2020-10-08T12:00:10.549+0530 [DEBUG] plugin: plugin started: path=/Users/vaishnavi/go/bin/terraform-provider-ibm pid=23206
2020-10-08T12:00:10.549+0530 [DEBUG] plugin: waiting for RPC address: path=/Users/vaishnavi/go/bin/terraform-provider-ibm
2020-10-08T12:00:10.606+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:10 IBM Cloud Provider version 1.12.0  
2020-10-08T12:00:10.609+0530 [INFO]  plugin.terraform-provider-ibm: configuring server automatic mTLS: timestamp=2020-10-08T12:00:10.609+0530
2020-10-08T12:00:10.642+0530 [DEBUG] plugin: using plugin: version=5
2020-10-08T12:00:10.642+0530 [DEBUG] plugin.terraform-provider-ibm: plugin address: address=/var/folders/0_/884stq5d51j7g5v4jnhv2y5r0000gn/T/plugin043811277 network=unix timestamp=2020-10-08T12:00:10.642+0530
2020-10-08T12:00:10.723+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:10 Configuring SoftLayer Session with API key
2020-10-08T12:00:10.723+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:10 Configuring IBM Cloud Session with API key
2020-10-08T12:00:10.723+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:10 [INFO] Configured Region: us-south
2020-10-08T12:00:12.380+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:12 the apiendpoint url for power is us-south.power-iaas.cloud.ibm.com
module.vpc.ibm_is_vpc.testacc_vpc: Creating...
2020/10/08 12:00:12 [DEBUG] module.vpc.ibm_is_vpc.testacc_vpc: applying the planned Create change
2020-10-08T12:00:12.391+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:12 [DEBUG] setting computed for "tags" from ComputedKeys
2020-10-08T12:00:12.391+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:12 [DEBUG] setting computed for "subnets" from ComputedKeys
2020-10-08T12:00:12.391+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:12 [DEBUG] setting computed for "security_group" from ComputedKeys
2020-10-08T12:00:12.391+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:12 [DEBUG] setting computed for "cse_source_addresses" from ComputedKeys
2020-10-08T12:00:12.391+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:12 [DEBUG] VPC create
2020-10-08T12:00:16.245+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:16 [INFO] VPC : r006-8c094ac0-afd5-48ca-8ac4-d6477d14d0be
2020-10-08T12:00:16.245+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:16 Waiting for VPC (r006-8c094ac0-afd5-48ca-8ac4-d6477d14d0be) to be available.
2020-10-08T12:00:16.245+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:16 [DEBUG] Waiting for state to become: [available failed]
module.vpc.ibm_is_vpc.testacc_vpc: Still creating... [10s elapsed]
2020-10-08T12:00:30.459+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:30 [DEBUG] vpc default network acl is not null :r006-ab69b2ce-be44-4277-abe2-d55fc0a247fa
2020-10-08T12:00:32.096+0530 [DEBUG] plugin.terraform-provider-ibm: 2020/10/08 12:00:32 tagList:  []
module.vpc.ibm_is_vpc.testacc_vpc: Still creating... [20s elapsed]
module.vpc.ibm_is_vpc.testacc_vpc: Creation complete after 21s [id=r006-8c094ac0-afd5-48ca-8ac4-d6477d14d0be]
2020-10-08T12:00:33.409+0530 [DEBUG] plugin: plugin process exited: path=/Users/vaishnavi/go/bin/terraform-provider-ibm pid=23206
2020-10-08T12:00:33.409+0530 [DEBUG] plugin: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```